; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 99719 2 1 3 3 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 Planet3)
	(pointing satellite1 Phenomenon5)
	(have_image Planet3 spectrograph0)
	(have_image Planet4 thermograph1)
	(have_image Phenomenon5 thermograph1)
	(have_image Phenomenon6 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite1 groundstation1 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 6
6. (turn_to satellite0 planet3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet3)
   goals met: 1 of 6
7. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 6
8. (take_image satellite0 planet3 instrument0 spectrograph0)
   added: (have_image planet3 spectrograph0)
   goals met: 2 of 6
9. (turn_to satellite1 planet4 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet4)
   goals met: 2 of 6
10. (take_image satellite1 planet4 instrument1 thermograph1)
   added: (have_image planet4 thermograph1)
   goals met: 3 of 6
11. (turn_to satellite0 phenomenon6 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 6
12. (turn_to satellite1 phenomenon5 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 6
13. (take_image satellite0 phenomenon6 instrument0 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 4 of 6
14. (take_image satellite1 phenomenon5 instrument1 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 5 of 6
15. (turn_to satellite0 planet3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet3)
   goals met: 6 of 6
